================================================================================
1 Binding parameters can be unused
================================================================================

(package coalton-unit-tests/unused-variables
  (import coalton-prelude))

(define (f x) 5)

--------------------------------------------------------------------------------

warn: Unused variable
  --> test:4:11
   |
 4 |  (define (f x) 5)
   |             ^ variable defined here
help: prefix the variable with '_' to declare it unused
 4 | (define (f _x) 5)
   |            --

================================================================================
2 Lambda parameters can be unused
================================================================================

(package coalton-unit-tests/unused-variables
  (import coalton-prelude))

(define f (fn (x) 5))

--------------------------------------------------------------------------------

warn: Unused variable
  --> test:4:15
   |
 4 |  (define f (fn (x) 5))
   |                 ^ variable defined here
help: prefix the variable with '_' to declare it unused
 4 | (define f (fn (_x) 5))
   |                --

================================================================================
3 Local variables can be unused
================================================================================

(package coalton-unit-tests/unused-variables
  (import coalton-prelude))

(define (f x)
  (let x = (+ 1 x))
  5)

--------------------------------------------------------------------------------

warn: Unused variable
  --> test:5:7
   |
 5 |    (let x = (+ 1 x))
   |         ^ variable defined here
help: prefix the variable with '_' to declare it unused
 5 |   (let _x = (+ 1 x))
   |        --

================================================================================
4 Pattern match variables can be unused
================================================================================

(package coalton-unit-tests/unused-variables
  (import coalton-prelude))

(define (f x)
  (match x
    ((Tuple x y) 5)))

--------------------------------------------------------------------------------

warn: Unused variable
  --> test:6:12
   |
 6 |      ((Tuple x y) 5)))
   |              ^ variable defined here
help: prefix the variable with '_' to declare it unused
 6 |     ((Tuple _x y) 5)))
   |             --

================================================================================
5 test-hidden-bindings
================================================================================

(package coalton-unit-tests/unused-variables
  (import coalton-prelude))

(define (f-hidden1) 5)

--------------------------------------------------------------------------------

================================================================================
6 test-hidden-bindings
================================================================================

(package coalton-unit-tests/unused-variables
  (import coalton-prelude))

(define f-hidden2 (fn () 5))

--------------------------------------------------------------------------------
